use crate::utils;

// IPA-Buchstaben: erst Buchstabe (Spaltenauswahl) – dann Ziffer (Zeilenauswahl)
pub fn run() {
    let keys = [
        "a",
        "b",
        "c",
        "d",
        "e",
        "f",
        "g",
        "h",
        "i",
        "j",
        "k",
        "l",
        "m",
        "n",
        "odiaeresis",
        "p",
        "q",
        "r",
        "s",
        "t",
        "udiaeresis",
        "v",
        "w",
        "x",
        "y",
        "z",
    ];
    let chars = [
        [
            "", "", "", "", "ᵊ", "ǀ", "", "ʰ", "", "ʲ", "", "ˡ", "", "ⁿ", "", "", "ˤ", "ɿ", "ˢ",
            "", "", "", "ʷ", "ˣ", "ʸ", "",
        ],
        [
            "", "ʙ", "", "ᶑ", "ɝ", "ǁ", "ɢ", "ʜ", "ɪ", "", "", "ʟ", "", "ɴ", "ɶ", "", "", "ʀ", "",
            "", "", "", "", "", "ʏ", "",
        ],
        [
            "ɐ", "", "", "", "ə", "ǂ", "", "ɥ", "", "", "ʞ", "ƛ", "ɯ", "", "", "", "", "ɹ", "ʅ",
            "ʇ", "", "ʌ", "ʍ", "", "ʎ", "",
        ],
        [
            "", "ɓ", "ƈ", "ɗ", "ɚ", "ǃ", "ɠ", "ɦ", "", "", "ƙ", "ɬ", "", "", "", "ƥ", "ʠ", "ɾ", "",
            "ƭ", "", "ⱱ", "", "", "", "",
        ],
        [
            "ɑ", "β", "ç", "ð", "ɛ", "ʘ", "ɣ", "ꟸ", "ɩ", "", "", "λ", "", "ɳ", "ɷ", "", "ʔ", "ʁ",
            "", "θ", "", "ʋ", "", "χ", "ʊ", "ʒ",
        ],
        [
            "ɒ", "ꞵ", "ʗ", "ɖ", "ɜ", "", "ɡ", "ɧ", "", "ʝ", "", "ɭ", "ɱ", "ŋ", "ɔ", "", "ʕ", "ɽ",
            "ʃ", "ʈ", "", "", "", "", "", "ʐ",
        ],
        [
            "", "", "", "ʣ", "ɞ", "ɸ", "ʛ", "ħ", "ɨ", "ɟ", "", "ɫ", "", "ƞ", "ɵ", "", "ʡ", "ɻ",
            "ʂ", "ƫ", "ʉ", "", "", "ʦ", "", "ƻ",
        ],
        [
            "", "[", "ɕ", "ʤ", "ʚ", "", "ɤ", "ʮ", "ˑ", "ʄ", "", "ȴ", "ɰ", "ȵ", "ø", "", "ʢ", "ɺ",
            "ʆ", "ȶ", "ˌ", "|", "", "ʧ", "", "ʑ",
        ],
        [
            "æ", "]", "", "ʥ", "ɘ", "", "ˠ", "ʯ", "ː", "‿", "", "ɮ", "", "ɲ", "œ", "", "ʖ", "ɼ",
            "", "ᶿ", "ˈ", "‖", "", "ʨ", "", "ʓ",
        ],
    ];

    let specials = [
        [
            "◌̽", "᷄", "", "◌̄", "◌̈", "", "", "", "◌̂", "◌̏", "◌̑", "", "᷈", "᷅", "◌̚", "◌̊", "◌́", "◌̃", "◌̇",
            "◌̋", "◌̌", "", "◌̀", "", "◌̆", "◌͡",
        ],
        [
            "◌̪", "◌̴", "◌̢", "◌̬", "◌̤", "◌̜", "◌̹", "◌̙", "◌̞", "◌̘", "◌̯", "◌̺", "◌̫", "", "◌̝", "◌̥", "◌̗",
            "◌̰", "◌̣", "◌̩", "◌̟", "◌̼", "◌̖", "◌̡", "◌̠", "◌̻",
        ],
        [
            "", "/", ")", "", "", "ʻ", "ʼ", "[", "˧", "]", "ꜛ", "ꜜ", "‖", "|", "˨", "˩", "ˑ", "˞",
            "", "˹", "˦", "ˈ", "ː", "(", "˥", "",
        ],
        [
            ",", "", "⸩", "", "", "", "", "{", "˕", "}", "↗", "↘", "", "", "˔", "", "ˏ", "", ".",
            "ˌ", "˖", "", "ˎ", "⸨", "˗", "‿",
        ],
    ];
    let short = [
        ("period", "ː"),
        ("colon", "ː"),
        ("comma", "ˑ"),
        ("plus", "ˈ"),
        ("minus", "ˌ"),
        ("numbersign", "‖"),
    ];
    for (ix, key) in keys.iter().enumerate() {
        for (num, row) in chars.iter().enumerate() {
            if !row[ix].is_empty() {
                print!("<dead_doubleacute> <{}> <{}>:", key, (num + 1),);
                utils::print_rule(row[ix]);
            }
        }
    }
    for (num, row) in specials.iter().enumerate() {
        for (ix, key) in keys.iter().enumerate() {
            if !row[ix].is_empty() {
                print!("<dead_doubleacute> <{}> <{}>:", (num + 1), key);
                utils::print_rule(row[ix]);
            }
        }
    }
    for (key, replacement) in short {
        print!("<dead_doubleacute> <{}>:", key);
        utils::print_rule(replacement);
    }
}
